{"_id":{"$oid":"5965e1e36941b01bcb0c2d6c"},"updatedAt":{"$date":"2017-07-12T09:31:11.377Z"},"createdAt":{"$date":"2017-07-12T08:46:27.505Z"},"title":"EXERCICE 1","content":"laetitiadervaux33@gmail.com  / aaa\n\n\n1. Ce qu’est un fork Github ?\n\u003e\u003e\u003e  copie d'un repository\n2. A quoi sert-il ? \n\u003e\u003e\u003e  Il permet de faire des modifications sans affecter le projet original\n3. Qu’est-ce qu’une pull request ? Quel est l’intérêt ?\n\u003e\u003e\u003e  une pull request permet de signifier aux collaborateurs les changements que l'on a pushés\n4. Qu’est-ce qu’une branche ?\n\u003e\u003e\u003e lors que l'on créee une branche , on diverge du projet initial et l'on peut ainsi travailler dessus sans toucher au master\n5. Quelle est la différence entre une branche et un fork ? \nLe fork partage et permet la copie d'un dossier, la branche permet à la personne qui a forké de travailler sur le projet sans toucher au projet initial","__v":0}
{"_id":{"$oid":"5965fbcf6941b01bcb0c2d6d"},"updatedAt":{"$date":"2017-07-12T14:09:50.045Z"},"createdAt":{"$date":"2017-07-12T10:37:03.228Z"},"title":"La MEAN stack","content":"Angular - FRONT, NON facultatif : Angular utilise le langage Javascript et permet de créer des Single Page Applications. Il utilise les concepts suivants : modele MVC, injection de dépendances, data Binding, manipulation du DOM à l'aide de components.\n\nAngular UI ROUTER - FRONT, NON facultatif : Permet la création de routes qui dispatchent vers les différentes vues et components; on peut y trouver un resolve faisant appel à un service.\n\nExpress - BACK, NON facultatif : framework appliqué à node, il permet de gérer les routes et d'utiliser des templates.\n\nJSONWebToken - BACK, NON facultatif : sert à l'authentification. JWT permet d’échanger du contenu pour un utilisateur authentifié grâce à la clé secrète utilisée dans la signature.\n\nMongoose - BACK, NON facultatif :  module de NodeJS qui utilise MongoDB pour la création de base de données structurées. Il utilise des « Schema » pour modéliser les données et permet de définir les types des champs.\n\nMaterializeCSS - FRONT, facultatif - framework de google, pour générer du CSS responsive\n\nPassport - BACK, NON facultatif : middleware d'authentification pour node JS, pour l'authentication ustilisant un username, un password, Facebook, Twitter...\n\nBabel - BACK / FRONT,, NON facultatif : compileur pour passer de ECMAScript 6 to ECMAScript 5 \n\nSCSS - FRONT, NON facultatif : fichier CSS issu de SASS, langage de génération de feuilles de styles\n\nNodemon -  TERMINAL, NON facultatif : utilitaire pour lancer l'application et restarter automatiquement à chaque changement\n\nWebpack - BACK / FRONT, NON facultatif : Webpack aide à organiser notre application JS en modules qui seront chargés par le navigateur\n\nLivereload - FRONT, facultatif : LiveReload applique les modification CSS / HTML sans recharger la page.","__v":0,"createdAT":{"$date":"2017-07-12T14:09:31.321Z"}}
{"_id":{"$oid":"59662c2b49161555370540cf"},"updatedAt":{"$date":"2017-07-26T22:00:00.000Z"},"title":"TEST DATE","content":"aez","createdAt":{"$date":"2017-07-26T22:00:00.000Z"},"createdAT":{"$date":"2017-07-12T14:03:23.000Z"},"__v":0}
